{"intents": [
        {"tag": "greeting",
	 "patterns": ["Hi", "How are you", "Is anyone there?", "Hello", "Good day", "Sup"],
	 "responses": ["Hello, how are you?", "Good to see you, what's up?", "Hi there, how can I help?", "Heyy! How's it going?", "Hiya, how're ya doin'?"],
	 "context_set": ""
	},
	{"tag": "goodbye",
	 "patterns": ["Bye", "See you later", "Goodbye"],
	 "responses": ["See you later, thanks for visiting", "Have a nice day", "Bye! Come back again soon."]
	},
	{"tag": "thanks",
	 "patterns": ["Thanks", "Thank you", "That's helpful"],
	 "responses": ["Happy to help!", "Any time!", "My pleasure"]
	},
	{"tag": "anger",
	 "patterns": ["i am just feeling cranky and blue", "i feel bitchy but not defeated yet", "i know what it feels like he stressed glaring down at her as she squeezed more soap onto her sponge", "i feel like taking a whack at someone s eye and spitting on it a cranky old lady i try to cheer myself up", "i feel mmf and i cant be bothered to fight it", "i know it so difficult especially when you feel you have been wronged", "i feel sometimes i am like heartless tin woodman sometimes like cowardly lion but i really want to believe there is a href http www", "i can really decode but im sorry i have to vomit my feelings out because i am so cranky and everything is getting on my nerves", "i have a feeling there will be many sarcastic quotes in this and future posts about him yikes", "i feel so damn fucking disgusted violated and hurt and angry and everything", "i told her that i woke up feeling mad that i am a woman and that i am probably always going to have to worry about being raped"],
	 "responses": ["You seem angry", "That seems to frustrate you"]
	},
	{"tag": "sadness",
	 "patterns": ["im feeling quite sad and sorry for myself but ill snap out of it soon", "i feel like i am still looking at a blank canvas blank pieces of paper", "i feel dirty and ashamed for saying that", "i woke up often got up around am feeling pukey radiation and groggy", "i was feeling sentimental", "i walked out of there an hour and fifteen minutes later feeling like i had been beaten with a stick and then placed on the rack and stretched", "i didn t feel abused and quite honestly it made my day a little better", "i feel try to tell me im ungrateful tell me im basically the worst", "i just feel like all my efforts are in vain and a waste of time", "i feel absolutely foolish for allowing myself to actually believe that this might be it for us the month weve been praying so hard for", "i waited for an eternity for it to download and now im remembering a day when i had to wait to go to walmart to buy a whole cd just to hear one song and feeling kinda dumb with my impatience"],
	 "responses": ["You seem sad", "This seems to sadden you", "You sound sad"]
	},
	{"tag": "joy",
	 "patterns": ["i can have for a treat or if i am feeling festive", "i start to feel more appreciative of what god has done for me", "i am feeling more confident that we will be able to take care of this baby", "i feel incredibly lucky just to be able to talk to her", "i feel less keen about the army every day", "i was dribbling on mums coffee table looking out of the window and feeling very happy", "i never stop feeling thankful as to compare with others i considered myself lucky because i did not encounter ruthless pirates and i did not have to witness the slaughter of others", "i had lunch with an old friend and it was nice but in general im not feeling energetic", "i feel that it is something that will never really be resolved", "i feel as if i am the beloved preparing herself for the wedding", "i have found in the past when i blog daily i have more to say and i get out my feelings and emotions in more creative ways", "i am feeling very blessed today that they share such a close bond"],
	 "responses": ["You seem pleased!", "I'm happy to hear you're happy!"]
	},
	{"tag": "love",
	 "patterns": ["i feel like faithful", "i loved that you could really feel the desperation in these sequences and i especially liked the emotion between knight and squire as theyve been together in a similar fashion to batman and robin for a long time now", "i feel like im caring about my body not just to be the right size but to feel good and have a full life", "i could still feel all romantic ish", "i see the starlight caress your hair no more feel the tender kisses we used to share i close my eyes and clearly my heart remembers a thousand good byes could never put out the embers", "i suppose a couple days of not feeling so hot is better than whooping cough the visit went really well", "i miss our talks our cuddling our kissing and the feelings that you can only share with your beloved", "i share what i bake with people because i love people and i want them to feel loved"],
	 "responses": ["Awww", "You sound like you're in love!"]
        },
	{"tag": "fear",
	 "patterns": ["i just know to begin with i am going to feel shy about it", "i feel very strange today", "i cant help to also feel a little restless", "i have gained some weight i feel very insecure in my self image", "i run a full computer scan with my avast antivirus it shows no viruses however i m still feeling kind of paranoid about these programs", "i for one am feeling a bit anxious at how long we are staying but i know we need to do this", "i knew there were a lot of hormonal things going on in my body too but the uncontrollable crying was still from feeling so uncertain about everything", "i was feeling frightened to the core what if my friends laughed at me what if sir was too harsh what if", "i don t know why this makes me feel so distraught", "i shouldnt feel threatened by that", "i was sleeping when i heard the neighbours screaming", "i didnt want to feel outcasted as the uptight religious mormon girl"],
	 "responses": ["You sound scared", "You seem fearful"]
        },
	{"tag": "surprise",
	 "patterns": ["i feel a funny mix of emotions", "im feeling a little dazed at the amount of items that i no longer use for decorations", "i am just feeling overwhelmed and there is nothing i can do to fix it", "id been feeling a bit funny all day verging on the kind of pre menstrual where you hate yourself so id been trying to take it really easy and just doing my own thing", "i feel overwhelmed by my circumstance in all of my mere human ness i will remember that god has landed here", "i almost feel a little bit weird about saying anything because it would almost feel like gossip", "i cant seem to get passed feeling stunned", "i need to be able to pursue the creative opportunities i crave without feeling like i m throwing my family under the bus funny how they still want to be fed even when i have a big gig to prepare for", "i feel like such a goof ball for the things i am curious about but i see life as this adventure that i get to embark on and i want to squeeze every ounce of good from it"],
	 "responses": ["You seem surprised", "Exciting!"]
	},
	{"tag": "selfharm",
	 "patterns": ["selfharm", "suicide", "kill", "die", "murder", "hotline", "call"],
	 "responses": ["You seem to be having troubling thoughts, please contact the national suicide hotline 988 or to https://www.samhsa.gov/find-help/national-helpline, I'm worried about you <3"]
        },
	{"tag": "disorderquestion",
	 "patterns": ["Can you help me identify what disorders I might have?", "Figure out what mental health issue I have", "Can you fingure out what mental health issues I have?"],
	 "responses": ["Yes, if you give me some symptoms, I could try estimating what type of disorders you could have", "Yes, gimme a list of symptoms rq"],
	 "context_set": "help"
        },
	{"tag": "anxiety",
	 "patterns": ["Feeling nervous, restless or tense", "Having a sense of impending danger, panic or doom", "Having an increased heart rate", "Breathing rapidly (hyperventilation)", "Sweating", "Trembling", "Feeling weak or tired", "Trouble concentrating or thinking about anything other than the present worry", "Having trouble sleeping", "Experiencing gastrointestinal (GI) problems", "Having difficulty controlling worry", "Having the urge to avoid things that trigger anxiety"],
	 "responses": ["Looks like you might have an anxiety disorder - refer to this site for more information https://www.mayoclinic.org/diseases-conditions/anxiety/symptoms-causes/syc-20350961, keep talkin!", "I think you have anxiety - refer to this site for more information https://www.mayoclinic.org/diseases-conditions/anxiety/symptoms-causes/syc-20350961, keep talkin!", "Based on your symptoms you might have an anxiety disorder - refer to this site for more information https://www.mayoclinic.org/diseases-conditions/anxiety/symptoms-causes/syc-20350961, keep talkin!"],
	 "context_filter": "help"
	},
	{"tag": "dissociative",
	 "patterns": ["feeling disconnected from yourself and the world around you", "forgetting about certain time periods, events and personal information", "feeling uncertain about who you are", "having multiple distinct identities", "feeling little or no physical pain"],
	 "responses": ["Looks like you might have an dissociative disorder - refer to this site https://www.nhs.uk/mental-health/conditions/dissociative-disorders/ for more information, keep talkin!", "I think you have dissociative disorders - refer to this site https://www.nhs.uk/mental-health/conditions/dissociative-disorders/ for more information, keep talkin!", "Based on your symptoms you might have a dissociative disorder - refer to this site https://www.nhs.uk/mental-health/conditions/dissociative-disorders/ for more information, keep talkin!"],
	 "context_filter": "help"
	},
	{"tag": "mood",
	 "patterns": ["Major depressive disorder — prolonged and persistent periods of extreme sadness", "Bipolar disorder — also called manic depression or bipolar affective disorder, depression that includes alternating times of depression and mania", "Seasonal affective disorder (SAD) — a form of depression most often associated with fewer hours of daylight in the far northern and southern latitudes from late fall to early spring", "Cyclothymic disorder — a disorder that causes emotional ups and downs that are less extreme than bipolar disorder", "Premenstrual dysphoric disorder — mood changes and irritability that occur during the premenstrual phase of a woman's cycle and go away with the onset of menses"],
	 "responses": ["Looks like you might have a mood disorder - refer to this site for more information https://www.mayoclinic.org/diseases-conditions/mood-disorders/symptoms-causes/syc-20365057, keep talkin!", "I think you have mood disorders - refer to this site for more information https://www.mayoclinic.org/diseases-conditions/mood-disorders/symptoms-causes/syc-20365057, keep talkin!", "Based on your symptoms you might have a mood disorder - refer to this site https://www.mayoclinic.org/diseases-conditions/mood-disorders/symptoms-causes/syc-20365057, keep talkin!"],
	 "context_filter": "help"
	},
	{"tag": "trauma",
	 "patterns": ["recurrent, involuntary and distressing memories, thoughts, and dreams and flashbacks of the traumatic event", "avoid internal memories, thoughts, feelings and/or avoid external people, places, situations which are reminders of the traumatic event and become a central focus of the individual’s life.", "Negative alterations in cognition and mood include problems remembering important aspects of the traumatic event, depression, fear, guilt, shame, and feelings of isolation from others.", "Hyper-arousal symptoms include being jumpy and easily startled, irritability, angry outbursts, self-destructive behavior, problems concentrating, and diffculty sleeping"],
	 "responses": ["Looks like you might have a trauma disorder - refer to this site for more information https://mentalhealthgateway.org/trauma-and-stress-related-disorders/, keep talkin!", "I think you have trauma disorders - refer to this site for more information https://mentalhealthgateway.org/trauma-and-stress-related-disorders/, keep talkin!", "Based on your symptoms you might have a trauma disorder - refer to this site https://mentalhealthgateway.org/trauma-and-stress-related-disorders/, keep talkin!"],
	 "context_filter": "help"
	},
	{"tag": "neurodevelopmental",
	 "patterns": ["language and speech issues", "motor skills issues", "behavior issues", "memory issues", "learning problems"],
	 "responses": ["Looks like you might have a neuro-developmental disorder - refer to this site for more information https://www.ncbi.nlm.nih.gov/books/NBK569702/, keep talkin!", "I think you have neuro-developmental disorders - refer to this site for more information https://www.ncbi.nlm.nih.gov/books/NBK569702/, keep talkin!", "Based on your symptoms you might have a neuro-developmental disorder - refer to this site https://www.ncbi.nlm.nih.gov/books/NBK569702/, keep talkin!"],
	 "context_filter": "help"
	},
	{"tag": "sleepwake",
	 "patterns": ["very sleepy during the daytime", "having trouble falling asleep at night", "Some people may fall asleep at inappropriate times, such as while driving", "breathing in an unusual pattern", "feeling an uncomfortable urge to move while you are trying to fall asleep", "Unusual or bothersome movements or experiences during sleep are also possible", "Having an irregular sleep and wake cycle"],
	 "responses": ["Looks like you might have a sleep-wake disorder - refer to this site for more informationhttps://www.mayoclinic.org/diseases-conditions/sleep-disorders/symptoms-causes/syc-20354018, keep talkin!", "I think you have sleep-wake disorders - refer to this site for more information https://www.mayoclinic.org/diseases-conditions/sleep-disorders/symptoms-causes/syc-20354018, keep talkin!", "Based on your symptoms you might have a sleep wake disorder - refer to this site https://www.mayoclinic.org/diseases-conditions/sleep-disorders/symptoms-causes/syc-20354018, keep talkin!"],
	 "context_filter": "help"
	},
	{"tag": "neurocognitive",
	 "patterns": ["Confusion", "Difficulty remembering and focusing", "Changes in a person’s normal behavior", "Vision problems", "Increased anxiety", "Increased agitation", "Trouble performing daily activities, like driving and managing money"],
	 "responses": ["Looks like you might have a neuro-cognitive disorder - refer to this site for more information https://www.siumed.org/blog/understanding-neurocognitive-disorders-types-causes-symptoms-and-treatment, keep talkin!", "I think you have neuro-cognitive disorders - refer to this site https://www.siumed.org/blog/understanding-neurocognitive-disorders-types-causes-symptoms-and-treatment for more information, keep talkin!", "Based on your symptoms you might have a neuro-cognitive disorder - refer to this site https://www.siumed.org/blog/understanding-neurocognitive-disorders-types-causes-symptoms-and-treatment, keep talkin!"],
	 "context_filter": "help"
	},
	{"tag": "addictive",
	 "patterns": ["Feeling that you have to use the drug regularly — daily or even several times a day", "Having intense urges for the drug that block out any other thoughts", "Over time, needing more of the drug to get the same effect", "Taking larger amounts of the drug over a longer period of time than you intended", "Making certain that you maintain a supply of the drug", "Spending money on the drug, even though you can't afford it", "Not meeting obligations and work responsibilities, or cutting back on social or recreational activities because of drug use", "Continuing to use the drug, even though you know it's causing problems in your life or causing you physical or psychological harm"],
	 "responses": ["Looks like you might have an addictive disorder - refer to this site for more information https://www.mayoclinic.org/diseases-conditions/drug-addiction/symptoms-causes/syc-20365112, keep talkin!", "I think you have addictive disorders - refer to this site https://www.mayoclinic.org/diseases-conditions/drug-addiction/symptoms-causes/syc-20365112 for more information, keep talkin!", "Based on your symptoms you might have an addictive disorder - refer to this site https://www.mayoclinic.org/diseases-conditions/drug-addiction/symptoms-causes/syc-20365112, keep talkin!"],
	 "context_filter": "help"
	},
	{"tag": "paraphilias",
	 "patterns": ["recurrent, intense, sexually arousing fantasies, urges, or behaviors that are distressing or disabling and that involve inanimate objects, children or nonconsenting adults, or suffering or humiliation of oneself or the partner with the potential to cause harm"],
	 "responses": ["Looks like you might have a paraphilias disorder - refer to this site for more information https://www.merckmanuals.com/professional/psychiatric-disorders/paraphilic-disorders/overview-of-paraphilic-disorders, keep talkin!", "I think you have paraphilias disorders - refer to this site for more information https://www.merckmanuals.com/professional/psychiatric-disorders/paraphilic-disorders/overview-of-paraphilic-disorders, keep talkin!", "Based on your symptoms you might have a paraphilias disorder - refer to this site https://www.merckmanuals.com/professional/psychiatric-disorders/paraphilic-disorders/overview-of-paraphilic-disorders, keep talkin!"],
	 "context_filter": "help"
	},
	{"tag": "somatic",
	 "patterns": ["Specific sensations, such as pain or shortness of breath, or more general symptoms, such as fatigue or weakness", "Unrelated to any medical cause that can be identified, or related to a medical condition such as cancer or heart disease, but more significant than what's usually expected", "A single symptom, multiple symptoms or varying symptoms", "Constant worry about potential illness", "Viewing normal physical sensations as a sign of severe physical illness", "Fearing that symptoms are serious, even when there is no evidence", "Thinking that physical sensations are threatening or harmful", "Feeling that medical evaluation and treatment have not been adequate"],
	 "responses": ["Looks like you might have a somatic disorder - refer to this site for more information https://www.mayoclinic.org/diseases-conditions/somatic-symptom-disorder/symptoms-causes/syc-20377776, keep talkin!", "I think you have somatic disorders - refer to this site https://www.mayoclinic.org/diseases-conditions/somatic-symptom-disorder/symptoms-causes/syc-20377776 for more information, keep talkin!", "Based on your symptoms you might have a somatic disorder - refer to this site https://www.mayoclinic.org/diseases-conditions/somatic-symptom-disorder/symptoms-causes/syc-20377776, keep talkin!"],
	 "context_filter": "help"
	},
	{"tag": "sexual",
	 "patterns": ["Inability to achieve or maintain an erection (hard penis) suitable for intercourse (erectile dysfunction).", "Absent or delayed ejaculation despite enough sexual stimulation (retarded ejaculation).", "Inability to control the timing of ejaculation (early, or premature, ejaculation).", "Inability to achieve orgasm.", "Inadequate vaginal lubrication before and during intercourse.", "Inability to relax the vaginal muscles enough to allow intercourse.", "Lack of interest in or desire for sex.", "Inability to become aroused.", "Pain with intercourse"],
	 "responses": ["Looks like you might have a sexual dysfunction - refer to this site for more information https://my.clevelandclinic.org/health/diseases/9121-sexual-dysfunction, keep talkin!", "I think you have sexual dysfunctions - refer to this site https://my.clevelandclinic.org/health/diseases/9121-sexual-dysfunction for more information, keep talkin!", "Based on your symptoms you might have a sexual dysfunction - refer to this site https://my.clevelandclinic.org/health/diseases/9121-sexual-dysfunction, keep talkin!"],
	 "context_filter": "help"
	},
	{"tag": "elimination",
	 "patterns": ["Loss of appetite", "Abdominal pain", "Loose, watery stools (bowel movements)", "Scratching or rubbing the anal area due to irritation from watery stools", "Decreased interest in physical activity", "Withdrawal from friends and family", "Secretive behavior associated with bowel movements"],
	 "responses": ["Looks like you might have an elimination disorder - refer to this site https://www.webmd.com/mental-health/elimination-disorders-encopresis for more information, keep talkin!", "I think you have elimination disorders - refer to this site https://www.webmd.com/mental-health/elimination-disorders-encopresis for more information, keep talkin!", "Based on your symptoms you might have a elimination disorder - refer to this site https://www.webmd.com/mental-health/elimination-disorders-encopresis, keep talkin!"],
	 "context_filter": "help"
	},
	{"tag": "eating",
	 "patterns": ["In general, behaviors and attitudes that indicate that weight loss, dieting, and control of food are becoming primary concerns", "Preoccupation with weight, food, calories, carbohydrates, fat grams, and dieting", "Refusal to eat certain foods, progressing to restrictions against whole categories of food (e.g., no carbohydrates, etc.)", "Appears uncomfortable eating around others", "Food rituals (e.g. eats only a particular food or food group [e.g. condiments], excessive chewing, doesn’t allow foods to touch)", "Skipping meals or taking small portions of food at regular meals", "Any new practices with food or fad diets, including cutting out entire food groups (no sugar, no carbs, no dairy, vegetarianism/veganism)"],
	 "responses": ["Looks like you might have an eating disorder - refer to this site https://www.nationaleatingdisorders.org/warning-signs-and-symptoms for more information, keep talkin!", "I think you have eating disorders - refer to this site for more information https://www.nationaleatingdisorders.org/warning-signs-and-symptoms, keep talkin!", "Based on your symptoms you might have an eating disorder - refer to this site https://www.nationaleatingdisorders.org/warning-signs-and-symptoms, keep talkin!"],
	 "context_filter": "help"
	},
	{"tag": "conduct",
	 "patterns": ["Angry/irritable mood—often loses temper, easily annoyed, often angry and resentful.", "Argumentative/defiant behavior—often argues with authority figures or adults, often refuses to comply with requests or rules, deliberately annoys others, blames others for mistakes or misbehavior.", "Vindictiveness—spiteful or vindictive.", "Aggression to people and animals (bullies, intimidates others, initiates fights, use of weapons, cruelty to others, cruelty to animals, stolen while confronting a victim, raped others).", "Destruction of property (deliberate fire setting, vandalization).", "Deceitfulness or theft (broken into properties, manipulates others, stolen).", "Serious violations of rules (runs away from home, truant from school, stays out at night).", "Are out of proportion to the event or incident that triggered them.", "Are impulsive.", "Cause much distress for the person.", "Cause problems at work or home"],
	 "responses": ["Looks like you might have a conduct disorder - refer to this site https://www.psychiatry.org/patients-families/disruptive-impulse-control-and-conduct-disorders/what-are-disruptive-impulse-control-and-conduct for more information, keep talkin!", "I think you have conduct disorders - refer to this site https://www.psychiatry.org/patients-families/disruptive-impulse-control-and-conduct-disorders/what-are-disruptive-impulse-control-and-conduct for more information, keep talkin!", "Based on your symptoms you might have a conduct disorder - refer to this site https://www.psychiatry.org/patients-families/disruptive-impulse-control-and-conduct-disorders/what-are-disruptive-impulse-control-and-conduct, keep talkin!"],
	 "context_filter": "help"
	},
	{"tag": "compulsive",
	 "patterns": ["Fear of contamination or dirt", "Doubting and having difficulty tolerating uncertainty", "Needing things orderly and symmetrical", "Aggressive or horrific thoughts about losing control and harming yourself or others", "Unwanted thoughts, including aggression, or sexual or religious subjects", "Fear of being contaminated by touching objects others have touched", "Doubts that you've locked the door or turned off the stove", "Intense stress when objects aren't orderly or facing a certain way", "Images of driving your car into a crowd of people", "Thoughts about shouting obscenities or acting inappropriately in public", "Unpleasant sexual images", "Avoidance of situations that can trigger obsessions, such as shaking hands", "Washing and cleaning", "Checking", "Counting", "Orderliness", "Following a strict routine", "Demanding reassurance", "Hand-washing until your skin becomes raw", "Checking doors repeatedly to make sure they're locked"],
	 "responses": ["Looks like you might have a compulsive disorder - refer to this site https://www.mayoclinic.org/diseases-conditions/obsessive-compulsive-disorder/symptoms-causes/syc-20354432 for more information, keep talkin!", "I think you have compulsive disorders - refer to this site for more information https://www.mayoclinic.org/diseases-conditions/obsessive-compulsive-disorder/symptoms-causes/syc-20354432, keep talkin!", "Based on your symptoms you might have a compulsive disorder - refer to this site https://www.mayoclinic.org/diseases-conditions/obsessive-compulsive-disorder/symptoms-causes/syc-20354432, keep talkin!"],
	 "context_filter": "help"
	},
	{"tag": "psychotic",
	 "patterns": ["Delusions. Having beliefs that do not align with reality.", "Hallucinations. Seeing and hearing things or people that aren’t really there.", "Disorganized speech or thinking. Jumping from topic to topic with no clear direction.", "Grossly disorganized or abnormal behavior. Acting peculiar or inappropriate, or being unable to carry out functions of day-to-day living.", "Negative symptoms. Having a diminished or absence of normal behaviors related to motivation and interest (for example, having no motivation to start or complete activities, finding it difficult to feel pleasure, disinterest in social activities) or expression (eg, fewer facial expressions and gestures, difficulty conversing)"],
	 "responses": ["Looks like you might have a psychotic disorder - refer to this site for more information https://www.psycom.net/schizophrenia/schizophrenia-spectrum, keep talkin!", "I think you have psychotic disorders - refer to this site for more information https://www.psycom.net/schizophrenia/schizophrenia-spectrum, keep talkin!", "Based on your symptoms you might have a psychotic disorder - refer to this site https://www.psycom.net/schizophrenia/schizophrenia-spectrum, keep talkin!"],
	 "context_filter": "help"
	},
	{"tag": "personality",
	 "patterns": ["Unjustified suspicion of the loyalty or trustworthiness of others", "Hesitancy to confide in others due to unreasonable fear that others will use the information against you", "Perception of innocent remarks or nonthreatening situations as personal insults or attacks", "Angry or hostile reaction to perceived slights or insults", "Tendency to hold grudges", "Unjustified, recurrent suspicion that spouse or sexual partner is unfaithful", "Lack of interest in social or personal relationships, preferring to be alone", "Limited range of emotional expression"],
	 "responses": ["Looks like you might have an personality disorder - refer to this site for more information, keep talkin!", "I think you have personality disorders - refer to this site for more information, keep talkin!", "Based on your symptoms you might have a personality disorder - refer to this site, keep talkin!"],
	 "context_filter": "help"
	}
   ]
}
